wangnan31415926/nrf5-sdk-15.3.0/examples/ble_peripheral/ble_app_bma250E_TM7711/main.c
unsigned char Mode_ID=0; //模式选择，变量

unsigned char Timer_lowpower_flag=0; //超时低功耗定时器标志位 0 关闭定时器；1 开启定时器
unsigned char Tm7711_poweroff_flag=0; //传感器断电标志位 0 断电，1 上电
unsigned char Send_TM7711_Data_flag=0; //发送数据标志位 0 不发送，1 发送
unsigned char Send_TM7711_Datatimer_flag=0; //发送数据定时器开启标志位  0 关闭定时器；1 开启定时器
unsigned char send_success_flag=0;          //发送完成标志位

unsigned short lowpower_timeout_count=0;//定时器计数变量
unsigned char senddata_count=0;


unsigned char COUNT_MAX_T=5; //连续发送5 秒
unsigned char COUNT_MAX=0;// ((COUNT_MAX_T*1000)/F_senddata);

unsigned char uartbuf[50];
unsigned char length=0;
unsigned char connect_flag=0;  //蓝牙是否连接标志位
unsigned char Adv_flag=0;      //蓝牙是否广播标志位
unsigned char bma250Lwp_flag=0;//传感器低功耗标志位
unsigned char bma250_i=0;
unsigned short bma250_j=0;
unsigned short lowpower_timer_i=0;//累计无动作时间
unsigned short num=0;              //包号
unsigned char dfu_flag=0;//进入升级模式标志位 1-进入升级模式
static uint16_t   m_conn_handle          = BLE_CONN_HANDLE_INVALID;                 /**< Handle of the current connection. */
static uint16_t   m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;            /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */
static ble_uuid_t m_adv_uuids[]          =                                          /**< Universally unique service identifier. */
{
    {BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}
};

/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}

static void application_timers_start(void)
{
    ret_code_t err_code;

    // Start application timers.
    err_code = app_timer_start(m_status_timer_id, APP_TIMER_TICKS(1000), NULL);
    APP_ERROR_CHECK(err_code);

}


void EnterDFU(void)
{
    #define BOOTLOADER_DFU_GPREGRET_MASK            (0xB0)      
    #define BOOTLOADER_DFU_START_BIT_MASK           (0x01)  
    #define BOOTLOADER_DFU_START    (BOOTLOADER_DFU_GPREGRET_MASK | BOOTLOADER_DFU_START_BIT_MASK)      
    sd_power_gpregret_clr(0,0xffffffff);
    sd_power_gpregret_set(0, BOOTLOADER_DFU_START);
    nrf_pwr_mgmt_shutdown(NRF_PWR_MGMT_SHUTDOWN_GOTO_DFU);
}


void Bluetooth_ReciveANDSend(void * p_event_data, uint16_t event_size)
{
	    for (uint32_t i = 0; i < length; i++)
    {
        app_uart_put(uartbuf[i]);
    }
		length=0;
}

////////////////////////////////////////////////////////////////////////
#define _timeout_ 180 //秒超时，进入无广播模式
void lowpower_timeout_handler(void * p_context)
{
		 UNUSED_PARAMETER(p_context);
	   lowpower_timeout_count++;
}


void Broadcast_ID_function(void)
{
	//判断是否广播
	if(Adv_flag==0)
		{    
			advertising_start();
			Adv_flag=1;//蓝牙广播标志位置1
		}//进行广播
		
	/////////////////////////////
	//判断超时无连接定时器是否开启
	if(Timer_lowpower_flag==0)
	{
	  app_timer_start(m_lowpower_timeout_id, APP_TIMER_TICKS(1000), NULL);//开启定时器，1秒定时器
		Timer_lowpower_flag=1;//标志位置位
		lowpower_timeout_count=0;//定时器计数清零
	}
	else
	{//是否超时
	   if(lowpower_timeout_count==_timeout_||lowpower_timeout_count>_timeout_)
		 {
			 app_timer_stop(m_lowpower_timeout_id);//停止定时器
			 Timer_lowpower_flag=0;//标志位清零
			 Mode_ID=No_Broadcast_ID;
			 //超时
		 }//超时，模式转换为无广播
			
	}
	
	/////////////////////////////
	//判断是否已连接
	if(connect_flag==1)
	{//已连接，关闭超时计时器，状态为已连接状态tm7711无供电
		app_timer_stop(m_lowpower_timeout_id);//停止定时器
		Timer_lowpower_flag=0;//标志位清零
		Mode_ID=Connect_TM7711_Nopower_ID;
	}
		
}


void No_Broadcast_ID_function(void)//(void * p_event_data, uint16_t event_size)
{
	if(Adv_flag!=0)//没有关闭广播
	 {//低功耗处理
		 if(connect_flag==0)
		 {
			sd_ble_gap_adv_stop(m_advertising.adv_handle);
			Adv_flag=0;//请标志位
		 }//关闭蓝牙广播
	 }

			 if(bma250Lwp_flag!=0)//传感器未进低功耗
			 {//低功耗处理
				 bma_lowpower();
			 }	 
	 
	  //
	 //判断是否有震动唤醒
	 if(BMA250_interrupt_status())
	 {//有震动唤醒，模式转换为广播模式
		 Mode_ID=Broadcast_ID;
		 bma250Lwp_flag=1;
	 }
}

#define Power_Countrol_pin 26
void TM7711_poweroff_function(void)
{
//	nrf_gpio_cfg_input(Power_Countrol_pin,GPIO_PIN_CNF_PULL_Disabled);
//	nrf_gpio_cfg_output(Power_Countrol_pin);
//  nrf_gpio_pin_clear(Power_Countrol_pin);
	
	 nrf_gpio_cfg_input(PD_SCK_7711_2,GPIO_PIN_CNF_PULL_Pulldown);
	nrf_gpio_cfg_input(DOUT_7711_2,GPIO_PIN_CNF_PULL_Pulldown);
	nrf_gpio_cfg_input(DOUT_7711,GPIO_PIN_CNF_PULL_Pulldown);
	nrf_gpio_cfg_input(PD_SCK_7711,GPIO_PIN_CNF_PULL_Pulldown);
	nrf_gpio_cfg_input(Power_Countrol_pin,GPIO_PIN_CNF_PULL_Pulldown);	
//	nrf_gpio_pin_clear(PD_SCK_7711_2);
//	nrf_gpio_pin_clear(DOUT_7711_2);
//	nrf_gpio_pin_clear(DOUT_7711);
//	nrf_gpio_pin_clear(PD_SCK_7711);
	
	
}

void TM7711_poweron_function(void)
{
	 nrf_gpio_cfg_output(Power_Countrol_pin);
	 nrf_gpio_pin_set(Power_Countrol_pin);
}

void Connect_TM7711_Nopower_ID_function(void)
{
	//判断7711是否断电
	if(Tm7711_poweroff_flag==1)
	{
		TM7711_poweroff_function();//传感器断电
		Tm7711_poweroff_flag=0;
	}
	
	//判断是否断开连接
	if(connect_flag==0)
	{//断开连接，模式为广播模式
		Mode_ID=Broadcast_ID;
	}
	
	//判断是否接收到指令发送传感器数据
	if(Send_TM7711_Data_flag==1)
	{//模式为传感器上电
		Mode_ID=Connect_TM7711_Powered_ID;
		Send_TM7711_Data_flag=0;
	}
	
}

void Read_Two_Tm7711_data(unsigned char* buf)
{
	 unsigned long a1=0xffffffff;
	 unsigned char flag=0;
	 unsigned long i=0;
	
	 
		while((flag==0)&&(i<0x200000))
		{
			if(nrf_gpio_pin_read(DOUT_7711)==0)
						{
						 a1=Read_TM7711(0x01);
							
							
						 buf[0]=a1/65536;		//高8位
						
						 buf[1]=a1/256%256;
						
						 buf[2]=a1%256;	
						}
						
			 if(nrf_gpio_pin_read(DOUT_7711_2)==0)
						{
						 a1=Read_TM7711_2(0x01);
							
							
						 buf[3]=a1/65536;		//高8位
						
						 buf[4]=a1/256%256;
						
						 buf[5]=a1%256;	
						}
						
				if((buf[0]|buf[1]|buf[2]!=0)&&(buf[3]|buf[4]|buf[5]!=0))
				{//由于读取传感器数据需要等待7711准备好才可以读取，因为是两个传感器，再同一时刻可能没有同时准备好
					flag=1;
					
//					buf[6]=i/65536;		//高8位 wndebug

//					buf[7]=i/256%256;

//					buf[8]=i%256;
				}
				
				i++;
		}
	
}

void Tm7711_init(void)
{
	GPIO_tm7711_init();
	GPIO_tm7711_2_init();
	Read_TM7711(0x01);
	Read_TM7711_2(0x01);
}

unsigned char F_senddata=200; //数据发送频率 200ms发送一次
void Connect_TM7711_Powered_ID_function(void)
{
	unsigned char i=0;
	//判断传感器是否上电
	if(Tm7711_poweroff_flag==0)
	{
	//传感器上电，初始化...
		TM7711_poweron_function();//传感器断上电
		Tm7711_poweroff_flag=1;
		nrf_delay_us(1000);
    Tm7711_init();
//		for(i=0;i<200;i++)//等待芯片上电稳定
//		{nrf_delay_us(1000);}
	}
	
	//判断是否开启定时发送数据定时器
	if((Send_TM7711_Datatimer_flag==0)&&(Tm7711_poweroff_flag==1))
	{//开启发送数据定时器
		senddata_count=0;               //发送计数器清零
		send_success_flag=0;            //发送完成标志清零
		COUNT_MAX=((COUNT_MAX_T*1000)/F_senddata);
		app_timer_start(m_senddata_timer_id, APP_TIMER_TICKS(F_senddata), NULL);//200ms 发送一次数据默认
		Send_TM7711_Datatimer_flag=1;

