wangnan31415926/nrf5-sdk-15.3.0/examples/ble_peripheral/ble_app_bma250E_TM7711/main.c
	}
	else
	{
		if(send_success_flag==1)//判断定时发送是否完成或收到停止发送指令
		{
			app_timer_stop(m_senddata_timer_id);
			Send_TM7711_Datatimer_flag=0;
			senddata_count=0;               //发送计数器清零
			send_success_flag=0;            //发送完成标志清零
			//发送完成，模式为传感器掉电
			Mode_ID=Connect_TM7711_Nopower_ID;
		}
	}
	
	//判断是否断开连接
	if(connect_flag==0)
	{
		//蓝牙断开连接，传感器断电
		
		app_timer_stop(m_senddata_timer_id);
		Send_TM7711_Datatimer_flag=0;
		senddata_count=0;               //发送计数器清零
		send_success_flag=0;            //发送完成标志清零
		
		TM7711_poweroff_function();//传感器断电
		Tm7711_poweroff_flag=0;
		
		Mode_ID=Broadcast_ID;//模式为广播模式
	}
}




unsigned char con_stop_flag=1;//连接情况下定时器停止标志位 1-定时器停止 0-定时器开启
//主流程
void status_handler(void * p_context)
	{
		 UNUSED_PARAMETER(p_context);
		
     nrf_drv_wdt_feed();
		
		 if(dfu_flag==1)
		 {
			EnterDFU();
			NVIC_SystemReset();
		 }
		 
		 //状态机，根据不同状态切换工作模式
		 switch (Mode_ID)
		 {
			 case Broadcast_ID:                             Broadcast_ID_function();
				 break;
			 case No_Broadcast_ID:                          
//				                                              No_Broadcast_ID_function();
																														if(Adv_flag!=0)//没有关闭广播
																											 {//低功耗处理
																												 if(connect_flag==0)
																												 {
																													sd_ble_gap_adv_stop(m_advertising.adv_handle);
																													Adv_flag=0;//请标志位
																												 }//关闭蓝牙广播
																											 }

																													 if(bma250Lwp_flag!=0)//传感器未进低功耗
																													 {//低功耗处理
																														 bma_lowpower();
																													 }	 
																											 
																												//
																											 //判断是否有震动唤醒
																											 if(BMA250_interrupt_status())
																											 {//有震动唤醒，模式转换为广播模式
																												 Mode_ID=Broadcast_ID;
																												 bma250Lwp_flag=1;
																											 }
				 break;
			 case Connect_TM7711_Nopower_ID:                Connect_TM7711_Nopower_ID_function();
				 break;
			 case Connect_TM7711_Powered_ID:                Connect_TM7711_Powered_ID_function();
				 break;
		 }
		 
		
////////		 if(lowpower_timer_i<(lowpower_timerover_max*30))
////////		 {
//////////		 lowpower_timer_i++;wn2020
////////		 }
////////		 else
////////		 {
////////			 
////////			 if(Adv_flag!=0)//没有关闭广播
////////			 {//低功耗处理
////////				 if(connect_flag==0)
////////         {
////////				  sd_ble_gap_adv_stop(m_advertising.adv_handle);
////////				  Adv_flag=0;//请标志位
////////				 }//关闭蓝牙广播
////////			 }

////////				if(con_stop_flag!=1)
////////					{
////////						app_timer_stop(m_test_timer_id); 
////////						con_stop_flag=1;
////////						bma250_i=0;
////////						bma250_j=0;
////////					}
////////				 
////////			 
////////			 
////////			 if(bma250Lwp_flag!=0)//传感器未进低功耗
////////			 {//低功耗处理
//////////				 bma_lowpower();wn2020
////////			 }
////////			 
////////		 }
////////		 
////////		 //定时读取中断标志位
//////////		 if(BMA250_interrupt_status())wn2020
//////////		 {
//////////		    lowpower_timer_i=0;
//////////			 
//////////				if(Adv_flag==0)//判断是否广播
//////////				{    
//////////				advertising_start();
//////////				Adv_flag=1;//蓝牙广播标志位置1
//////////				}//进行广播
//////////				
//////////  			if(bma250Lwp_flag==0)//判断bma250是否进入工作模式
//////////				{bma_init();}//bma250进入工作模式
//////////				
//////////				if(con_stop_flag==1)
//////////				{
//////////					app_timer_start(m_test_timer_id, APP_TIMER_TICKS(20), NULL);
//////////					con_stop_flag=0;
//////////					num=0;
//////////				}
//////////		 }
//////////			 
//////////		
	}


void senddata_handler(void * p_context)
{
	 UNUSED_PARAMETER(p_context);

	 if(senddata_count==COUNT_MAX||senddata_count>COUNT_MAX)
	 {
		 //发送结束
		 send_success_flag=1;
	 }
	 else
	 {
		 senddata_count++;
		 if(connect_flag==1)
		 {
			 memset(uartbuf,0,6);
			 Read_Two_Tm7711_data(uartbuf);//读取数据
			//						bma250_j=6+3;wndebug
			 bma250_j=6;
			 if(connect_flag==1)
			 {
			  ble_nus_data_send(&m_nus, uartbuf, &bma250_j, m_conn_handle);//发送数据
			 }
		 }
	 }
   
//bma250_j=3;
//	 if(nrf_gpio_pin_read(DOUT_7711)==0)
//  	    {
//         a1=Read_TM7711(0x01);
//					
//					
//				 uartbuf[0]=a1/65536;		//高8位
//				
//				 uartbuf[1]=a1/256%256;
//				
//				 uartbuf[2]=a1%256;
//					
//					if(connect_flag==1)
//					{

//					ble_nus_data_send(&m_nus, uartbuf, &bma250_j, m_conn_handle);
//		
//					}	
//				}

}

/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for initializing the timer module.
 */
static void timers_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
	
	    err_code = app_timer_create(&m_senddata_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                senddata_handler);
      APP_ERROR_CHECK(err_code);
	
		  err_code = app_timer_create(&m_status_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                status_handler);//状态机定时器
      APP_ERROR_CHECK(err_code);
	
		  err_code = app_timer_create(&m_lowpower_timeout_id,
                                APP_TIMER_MODE_REPEATED,
                                lowpower_timeout_handler);//低功耗超时
      APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)//蓝牙接收到数据
{

    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
        uint32_t err_code;
			  unsigned char ack[]="success";
			  unsigned short len=sizeof(ack);

